#include "includeall.h"
#include	"FuncLogic_key.h"
#include "FuncTab.h"

/****************************************************************************************************************************************** 
* 函数名称:	GetKeySongKai_time
* 功能说明:	获取按键松开时长
* 输    入: 无	
* 输    出: 无
******************************************************************************************************************************************/
u8 GetKeySongKai_time(void)
{
		 return sKey_yyy.Bit.gNoKeyTime;
}

/****************************************************************************************************************************************** 
* 函数名称:	KeySelect
* 功能说明:	选择按键
* 输    入: 无	
* 输    出: 无
* 注意事项: 单按键轮流切换
******************************************************************************************************************************************/
void KeySelectMode(void)
{
		if(!SysRunFlag)
			return;
		
		if(/*!Auto1Flag && !Auto2Flag !*/Auto3Flag)
		{
				Auto1Flag = 1;
				Auto2Flag = 0;
				Auto3Flag = 0;			
				//SetSysRunTime(DefaultTimerTab[0]);
		}
		else if(Auto1Flag)
		{
				Auto1Flag = 0;
				Auto2Flag = 1;
				//SetSysRunTime(DefaultTimerTab[1]);
		}
		else
		{
				Auto1Flag = 0;
				Auto2Flag = 0;
				Auto3Flag = 1;
				//SetSysRunTime(DefaultTimerTab[1]);
		}		
}
/****************************************************************************************************************************************** 
*函数名称 SetSysRunTime
*函数功能 设置系统运行时间	
*输入 ：xxx分钟
*输出： 无
******************************************************************************************************************************************/

void SetSysRunTime(u8 v)
{
	gSetSysRunTime = v;
	gSysRunTime = gSetSysRunTime*60;
}

/****************************************************************************************************************************************** 
* 功能说明:	* 函数名称:	KeySelect
* 功能说明:	选择按键
* 输    入: 无	
* 输    出: 无
* 输    入: 无	
* 输    出: 无
* 注意事项:
******************************************************************************************************************************************/
void SelectWorkMode(u8 v)
{
		if(!SysRunFlag)
			return;
		
		if(v ==1)
		{
				Auto1Flag = 1;
				Auto2Flag = 0;
				Auto3Flag = 0;					
				SetSysRunTime(DefaultTimerTab[0]);
		}
		else if(v == 2)
		{
				Auto1Flag = 0;
				Auto2Flag = 1;
				Auto3Flag = 0;	
				SetSysRunTime(DefaultTimerTab[1]);
		}
		else
		{
				Auto1Flag = 0;
				Auto2Flag = 0;
				Auto3Flag = 1;
				SetSysRunTime(DefaultTimerTab[1]);
		}		
}

/****************************************************************************************************************************************** 
* 函数名称:	KeyLongPress
* 功能说明:	判断哪个按键按下,执行的是开关机功能
* 输    入: 按键值	
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/
void KeyLongPress(u8 v)
{
	u8 KeyChanal = v;
	
	switch(KeyChanal)//判断哪个按键按下
	{
		case 1://执行的开关机功能
			
		break;

		default:
			break;	
	}
}

/****************************************************************************************************************************************** 
* 函数名称:	KeyShortPress
* 功能说明:	判断哪个按键按下
* 输    入: 按键值	
* 输    出: 无
* 注意事项: 无
******************************************************************************************************************************************/

void KeyShortPress(u8 v)
{
	u8 KeyChanal = v;
	
  
	switch(KeyChanal)//判断哪个按键按下
	{	
			case 2:	

			break;

			default :
				break;			
	}
}

 void 	QuitMode(void)
 {	 
	
 }


void SetNoKeyTime(u8 v)
{
		sKey_yyy.Bit.gNoKeyTime = v;
}


